tests:
  - expression: '{}'
    result: []
  - expression: "'a\\\\b\\'\\\"\\`\\r\\n\\t\\u0065'" # double escape for YAML
    result: ["a\\b'\"`\r\n\te"]
  - expression: "2 'mo'"
    result: ["2 'mo'"]
  - expression: "2 years"
    result: ["2 years"]
  - expression: "@2019"
    result: ["2019"]
  - expression: '-7'
    result: [-7]
  - expression: '-7.3'
    result: [-7.3]
  - expression: '+7'
    result: [+7]
  - expression: '(-7).combine(3)'
    result: [-7, 3]
  - expression: '-7.combine(3)' # same as next case
    error: true
  - expression: '-((7).combine(3))'
    error: true # per Bryn
  - expression: '-true'
    error: true
  - expression: "-'zzz'"
    error: true

subject:
  prop: val
