tests:
  - expression: '{}'
    result: []
  - expression: "'a\\\\b\\'\\\"\\`\\r\\n\\t\\u0065'" # double escape for YAML
    result: ["a\\b'\"`\r\n\te"]
  - expression: "2 'mo'"
    result: ["2 'mo'"]
  - expression: "2 years"
    result: ["2 years"]
  - expression: "@2019"
    result: ["2019"]
subject:
  prop: val
